Creating Data Frames

In [4]:
                                                                                                                                                                                                                                                                                                                            #Empty Dataframe
#import the pandas library and aliasing as pd
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
#Creating dataframes from list
import pandas as pd
data = [1,2,3,4,5]
df = pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [17]:
import pandas as pd
data = [['Ahmed',35],['Ali',17],['Omar',25]]
DataFrame1 = pd.DataFrame(data,columns=['Name','Age'], index=[1,2,3])
print (DataFrame1)

    Name  Age
1  Ahmed   35
2    Ali   17
3   Omar   25

In [6]:
# Dataframe using a dictioinary
import pandas as pd
data = {'Name':['Ahmed', 'Ali', 'Omar','Salwa'],'Age':[35,17,25,30]}
dataframe2 = pd.DataFrame(data, index=[100, 101, 102, 103])
print (dataframe2)

      Name  Age
100  Ahmed   35
101    Ali   17
102   Omar   25
103  Salwa   30

In [12]:
import pandas as pd
data = {'Name':['Ahmed', 'Ali', 'Omar',
'Salwa'],'Age':[35,17,25,30]}
dataframe2 = pd.DataFrame(data, index=[100, 101, 102, 103], dtype=float)
print (dataframe2)

      Name   Age
100  Ahmed  35.0
101    Ali  17.0
102   Omar  25.0
103  Salwa  30.0

C:\Users\Mahe\AppData\Local\Temp\ipykernel_11392\3619789387.py:4: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  dataframe2 = pd.DataFrame(data, index=[100, 101, 102, 103], dtype=float)

Creating Data Frames from List of Dicts

In [2]:
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
print(df)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [16]:
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data, index=['first', 'second'])
print (df)

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [17]:
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]

#With two column indices, values same as dictionary keys
df1 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b'])

#With two column indices with one index with other name
df2 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b1'])
print (df1)
print (df2)

        a   b
first   1   2
second  5  10
        a  b1
first   1 NaN
second  5 NaN

In [ ]:
Creating Data Frames from a Dict of Series

In [4]:
import pandas as pd
dict1 = {'one' : pd.Series([1., 2., 3.],
    index=['a', 'b', 'c']),'two' : pd.Series([1., 2., 3., 4.],
    index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(dict1)

TypeError: 'method' object is not subscriptable

In [2]:
# set index for the DataFrame
pd.DataFrame(dict1, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [3]:
#Control the labels appearance of the DataFrame
pd.DataFrame(dict1, index=['d', 'b', 'a'], columns=['two',
'three', 'one'])

   two three  one
d  4.0   NaN  NaN
b  2.0   NaN  2.0
a  1.0   NaN  1.0

Creating Data Frames from a Dict of Ndarrays/Lists

In [7]:
# Creating Data frame using an Ndarray
#  without index
ndarrdict = {'one' : [1., 2., 3., 4.],'two' :[4., 3., 2., 1.]}
pd.DataFrame(ndarrdict)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [8]:
# Assign index
pd.DataFrame(ndarrdict, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [9]:
pd.DataFrame(ndarrdict, index=[0,1,2,3])

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

Creating Data Frames from a Structured or Record Array

In [8]:
import pandas as pd
import numpy as np
data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')])
print(data)
data[:] = [(1,2.,'Hello'), (2,3.,"World")]
pd.DataFrame(data)

[(0, 0., b'') (0, 0., b'')]

   A    B         C
0  1  2.0  b'Hello'
1  2  3.0  b'World'

In [8]:
pd.DataFrame(data, index=['First', 'Second'])

        A    B         C
First   1  2.0  b'Hello'
Second  2  3.0  b'World'

In [9]:
pd.DataFrame(data, columns=['C', 'A', 'B'])

          C  A    B
0  b'Hello'  1  2.0
1  b'World'  2  3.0

Creating Data Frames from a List of Dicts

In [11]:
data2 = [{'A': 1, 'B': 2}, {'A': 5, 'B': 10, 'C': 20}]
pd.DataFrame(data2)

   A   B     C
0  1   2   NaN
1  5  10  20.0

In [12]:
pd.DataFrame(data2, index=['First', 'Second'])

        A   B     C
First   1   2   NaN
Second  5  10  20.0

In [13]:
pd.DataFrame(data2, columns=['A', 'B'])

   A   B
0  1   2
1  5  10

Selecting, Adding, and Deleting Data Frame Columns

In [8]:
#Adding Columns and Making Operations on a Created Data Frame
# DATAFRAME COLUMN SELECTION, ADDITION, DELETION
ndarrdict = {'one' : [1., 2., 3., 4.], 'two' :[4., 3., 2., 1.]}
df = pd.DataFrame(ndarrdict, index=['a', 'b', 'c', 'd'])
df

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [9]:
df['three'] = df['one'] * df['two'] # Add column
df['flag'] = df['one'] > 2 # Add column
df

   one  two  three   flag
a  1.0  4.0    4.0  False
b  2.0  3.0    6.0  False
c  3.0  2.0    6.0   True
d  4.0  1.0    4.0   True

In [10]:
#Adding a Column Using a Scalar and Assigning to a Data Frame
df['Filler'] = 'HCT'
df['Slic'] = df['one'][:2]
df

   one  two  three   flag Filler  Slic
a  1.0  4.0    4.0  False    HCT   1.0
b  2.0  3.0    6.0  False    HCT   2.0
c  3.0  2.0    6.0   True    HCT   NaN
d  4.0  1.0    4.0   True    HCT   NaN

In [11]:
# Delet columns
del df['two']
Three = df.pop('three')
df

   one   flag Filler  Slic
a  1.0  False    HCT   1.0
b  2.0  False    HCT   2.0
c  3.0   True    HCT   NaN
d  4.0   True    HCT   NaN

In [12]:
#dataframe.insert (loc, column, value, allow_duplicates)
df.insert(1, 'bar', df['one'])
df

   one  bar   flag Filler  Slic
a  1.0  1.0  False    HCT   1.0
b  2.0  2.0  False    HCT   2.0
c  3.0  3.0   True    HCT   NaN
d  4.0  4.0   True    HCT   NaN

Assigning New Columns in Method Chains

In [13]:
import numpy as np
import pandas as pd
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
df = df.assign(C=lambda x: x['A'] + x['B'])
df = df.assign( D=lambda x: x['A'] + x['C'])
df

   A  B  C   D
0  1  4  5   6
1  2  5  7   9
2  3  6  9  12

In [14]:
df = df.assign( A=lambda x: x['A'] *2)
df

   A  B  C   D
0  2  4  5   6
1  4  5  7   9
2  6  6  9  12

Indexing and Selecting Data Frames

Data Frame Row and Column Selections

In [24]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [16]:
df['B']

0    4
1    5
2    6
Name: B, dtype: int64

In [17]:
df.iloc[2]

A     6
B     6
C     9
D    12
Name: 2, dtype: int64

In [18]:
df[1:]

   A  B  C   D
1  4  5  7   9
2  6  6  9  12

In [19]:
df[df['C']>7]

   A  B  C   D
2  6  6  9  12

Operations on Data Frames

In [26]:
df1 = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
df2 = pd.DataFrame({"A": [7, 4, 6], "B": [10, 4, 15]})
print (df1)
print()
print(df2)

   A  B
0  1  4
1  2  5
2  3  6

   A   B
0  7  10
1  4   4
2  6  15

In [21]:
df1+df2

   A   B
0  8  14
1  6   9
2  9  21

In [22]:
df1-df2

   A  B
0 -6 -6
1 -2  1
2 -3 -9

In [28]:
print(df2)
df2 - df1.iloc[2]

   A   B
0  7  10
1  4   4
2  6  15

   A  B
0  4  4
1  1 -2
2  3  9

In [24]:
df2

   A   B
0  7  10
1  4   4
2  6  15

In [25]:
df2*2+1

    A   B
0  15  21
1   9   9
2  13  31

Transposing a Data Frame

In [26]:
df2

   A   B
0  7  10
1  4   4
2  6  15

In [28]:
df2[:].T

    0  1   2
A   7  4   6
B  10  4  15

Data Frame Interoperability with Numpy Functions

In [29]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [30]:
df1.T.dot(df1)

    A   B
A  14  32
B  32  77

In [4]:
#Load csv file/spreadsheet into a data frame
df = pd.read_csv('weather.csv')
df

     outlook  temperature  humidity  windy play
0      sunny           85        85  False   no
1      sunny           80        90   True   no
2   overcast           83        86  False  yes
3      rainy           70        96  False  yes
4      rainy           68        80  False  yes
5      rainy           65        70   True   no
6   overcast           64        65   True  yes
7      sunny           72        95  False   no
8      sunny           69        70  False  yes
9      rainy           75        80  False  yes
10     sunny           75        70   True  yes
11  overcast           72        90   True  yes
12  overcast           81        75  False  yes
13     rainy           71        91   True   no

In [18]:
df.head(5)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [19]:
df.tail(3)

   one  two
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [21]:
df['temperature']

KeyError: 'temperature'

In [22]:
f['temperature'].max()

NameError: name 'f' is not defined

In [ ]:
df.describe()

In [ ]:
df[df['temperature']>30]

In [ ]:
df['play'][df['temperature']>30]